In [35]:
import pandas as pd

In [36]:
df = pd.read_csv('train.csv')

Создала дополнительный столбец для учета суммы погибших:

In [37]:
df['Die'] = '0'

Заполнила столбец "Die", протиивополжными значениями от "Survived":

In [44]:
for i in range(len(df)):
    if df.loc[i]['Survived'] == 0:
        df.loc[i, 'Die'] = 1
    else:
        df.loc[i, 'Die'] = 0
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Die
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1

Средний возвраст пассажиров:

In [46]:
df["Age"].mean()

29.69911764705882

In [47]:
df.groupby("Survived")["Survived"].count()

Survived
0    549
1    342
Name: Survived, dtype: int64

549 человек умерло, 342 выжило

In [48]:
df.groupby(["Sex"])["Age"].mean().round(0)

Sex
female    28.0
male      31.0
Name: Age, dtype: float64

Средний возвраст женщин на титанике - 28 лет, мужчин - 31 год

In [49]:
df.groupby(["Sex","Survived","Die"]).agg({"Survived": "sum","Die": "sum" })

                     Survived  Die
Sex    Survived Die
female 0        1           0   81
       1        0         233    0
male   0        1           0  468
       1        0         109    0

Мужчин погибло почти в 6 раз больше, чем женщин

In [51]:
df.groupby(["Pclass","Survived","Die"]).agg({"Survived": "sum","Die": "sum" })

                     Survived  Die
Pclass Survived Die
1      0        1           0   80
       1        0         136    0
2      0        1           0   97
       1        0          87    0
3      0        1           0  372
       1        0         119    0

Из 3гго класса погибло больше всего пассажиров